# UnresolvableErrorInFamilyWarn Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GeneralFailures..::..UnresolvableErrorInFamilyWarn Property
BuiltInFailures..::..GeneralFailures Class See Also
---
An error occurred in family "[Name]" that cannot be automatically resolved.\nError Information:\n"[Text]"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UnresolvableErrorInFamilyWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UnresolvableErrorInFamilyWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UnresolvableErrorInFamilyWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GeneralFailures Class
Autodesk.Revit.DB Namespace